espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/BGM21/Include/bgm21_rtcc.h
/* Bit fields for RTCC CMD */
#define _RTCC_CMD_RESETVALUE                    0x00000000UL                            /**< Default value for RTCC_CMD                  */
#define _RTCC_CMD_MASK                          0x00000003UL                            /**< Mask for RTCC_CMD                           */
#define RTCC_CMD_START                          (0x1UL << 0)                            /**< Start RTCC main counter                     */
#define _RTCC_CMD_START_SHIFT                   0                                       /**< Shift value for RTCC_START                  */
#define _RTCC_CMD_START_MASK                    0x1UL                                   /**< Bit mask for RTCC_START                     */
#define _RTCC_CMD_START_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for RTCC_CMD                   */
#define RTCC_CMD_START_DEFAULT                  (_RTCC_CMD_START_DEFAULT << 0)          /**< Shifted mode DEFAULT for RTCC_CMD           */
#define RTCC_CMD_STOP                           (0x1UL << 1)                            /**< Stop RTCC main counter                      */
#define _RTCC_CMD_STOP_SHIFT                    1                                       /**< Shift value for RTCC_STOP                   */
#define _RTCC_CMD_STOP_MASK                     0x2UL                                   /**< Bit mask for RTCC_STOP                      */
#define _RTCC_CMD_STOP_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for RTCC_CMD                   */
#define RTCC_CMD_STOP_DEFAULT                   (_RTCC_CMD_STOP_DEFAULT << 1)           /**< Shifted mode DEFAULT for RTCC_CMD           */

/* Bit fields for RTCC STATUS */
#define _RTCC_STATUS_RESETVALUE                 0x00000000UL                                /**< Default value for RTCC_STATUS               */
#define _RTCC_STATUS_MASK                       0x00000003UL                                /**< Mask for RTCC_STATUS                        */
#define RTCC_STATUS_RUNNING                     (0x1UL << 0)                                /**< RTCC running status                         */
#define _RTCC_STATUS_RUNNING_SHIFT              0                                           /**< Shift value for RTCC_RUNNING                */
#define _RTCC_STATUS_RUNNING_MASK               0x1UL                                       /**< Bit mask for RTCC_RUNNING                   */
#define _RTCC_STATUS_RUNNING_DEFAULT            0x00000000UL                                /**< Mode DEFAULT for RTCC_STATUS                */
#define RTCC_STATUS_RUNNING_DEFAULT             (_RTCC_STATUS_RUNNING_DEFAULT << 0)         /**< Shifted mode DEFAULT for RTCC_STATUS        */
#define RTCC_STATUS_RTCCLOCKSTATUS              (0x1UL << 1)                                /**< Lock Status                                 */
#define _RTCC_STATUS_RTCCLOCKSTATUS_SHIFT       1                                           /**< Shift value for RTCC_RTCCLOCKSTATUS         */
#define _RTCC_STATUS_RTCCLOCKSTATUS_MASK        0x2UL                                       /**< Bit mask for RTCC_RTCCLOCKSTATUS            */
#define _RTCC_STATUS_RTCCLOCKSTATUS_DEFAULT     0x00000000UL                                /**< Mode DEFAULT for RTCC_STATUS                */
#define _RTCC_STATUS_RTCCLOCKSTATUS_UNLOCKED    0x00000000UL                                /**< Mode UNLOCKED for RTCC_STATUS               */
#define _RTCC_STATUS_RTCCLOCKSTATUS_LOCKED      0x00000001UL                                /**< Mode LOCKED for RTCC_STATUS                 */
#define RTCC_STATUS_RTCCLOCKSTATUS_DEFAULT      (_RTCC_STATUS_RTCCLOCKSTATUS_DEFAULT << 1)  /**< Shifted mode DEFAULT for RTCC_STATUS        */
#define RTCC_STATUS_RTCCLOCKSTATUS_UNLOCKED     (_RTCC_STATUS_RTCCLOCKSTATUS_UNLOCKED << 1) /**< Shifted mode UNLOCKED for RTCC_STATUS       */
#define RTCC_STATUS_RTCCLOCKSTATUS_LOCKED       (_RTCC_STATUS_RTCCLOCKSTATUS_LOCKED << 1)   /**< Shifted mode LOCKED for RTCC_STATUS         */

/* Bit fields for RTCC IF */
#define _RTCC_IF_RESETVALUE                     0x00000000UL                            /**< Default value for RTCC_IF                   */
#define _RTCC_IF_MASK                           0x0000001FUL                            /**< Mask for RTCC_IF                            */
#define RTCC_IF_OF                              (0x1UL << 0)                            /**< Overflow Interrupt Flag                     */
#define _RTCC_IF_OF_SHIFT                       0                                       /**< Shift value for RTCC_OF                     */
#define _RTCC_IF_OF_MASK                        0x1UL                                   /**< Bit mask for RTCC_OF                        */
#define _RTCC_IF_OF_DEFAULT                     0x00000000UL                            /**< Mode DEFAULT for RTCC_IF                    */
#define RTCC_IF_OF_DEFAULT                      (_RTCC_IF_OF_DEFAULT << 0)              /**< Shifted mode DEFAULT for RTCC_IF            */
#define RTCC_IF_CNTTICK                         (0x1UL << 1)                            /**< Main counter tick                           */
#define _RTCC_IF_CNTTICK_SHIFT                  1                                       /**< Shift value for RTCC_CNTTICK                */
#define _RTCC_IF_CNTTICK_MASK                   0x2UL                                   /**< Bit mask for RTCC_CNTTICK                   */
#define _RTCC_IF_CNTTICK_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for RTCC_IF                    */
#define RTCC_IF_CNTTICK_DEFAULT                 (_RTCC_IF_CNTTICK_DEFAULT << 1)         /**< Shifted mode DEFAULT for RTCC_IF            */
#define RTCC_IF_CC0                             (0x1UL << 2)                            /**< CC Channel n Interrupt Flag                 */
#define _RTCC_IF_CC0_SHIFT                      2                                       /**< Shift value for RTCC_CC0                    */
#define _RTCC_IF_CC0_MASK                       0x4UL                                   /**< Bit mask for RTCC_CC0                       */
#define _RTCC_IF_CC0_DEFAULT                    0x00000000UL                            /**< Mode DEFAULT for RTCC_IF                    */
#define RTCC_IF_CC0_DEFAULT                     (_RTCC_IF_CC0_DEFAULT << 2)             /**< Shifted mode DEFAULT for RTCC_IF            */
#define RTCC_IF_CC1                             (0x1UL << 3)                            /**< CC Channel n Interrupt Flag                 */
#define _RTCC_IF_CC1_SHIFT                      3                                       /**< Shift value for RTCC_CC1                    */
#define _RTCC_IF_CC1_MASK                       0x8UL                                   /**< Bit mask for RTCC_CC1                       */
#define _RTCC_IF_CC1_DEFAULT                    0x00000000UL                            /**< Mode DEFAULT for RTCC_IF                    */
#define RTCC_IF_CC1_DEFAULT                     (_RTCC_IF_CC1_DEFAULT << 3)             /**< Shifted mode DEFAULT for RTCC_IF            */
#define RTCC_IF_CC2                             (0x1UL << 4)                            /**< CC Channel n Interrupt Flag                 */
#define _RTCC_IF_CC2_SHIFT                      4                                       /**< Shift value for RTCC_CC2                    */
#define _RTCC_IF_CC2_MASK                       0x10UL                                  /**< Bit mask for RTCC_CC2                       */
#define _RTCC_IF_CC2_DEFAULT                    0x00000000UL                            /**< Mode DEFAULT for RTCC_IF                    */
#define RTCC_IF_CC2_DEFAULT                     (_RTCC_IF_CC2_DEFAULT << 4)             /**< Shifted mode DEFAULT for RTCC_IF            */

/* Bit fields for RTCC IEN */
#define _RTCC_IEN_RESETVALUE                    0x00000000UL                            /**< Default value for RTCC_IEN                  */
#define _RTCC_IEN_MASK                          0x0000001FUL                            /**< Mask for RTCC_IEN                           */
#define RTCC_IEN_OF                             (0x1UL << 0)                            /**< OF Interrupt Enable                         */
#define _RTCC_IEN_OF_SHIFT                      0                                       /**< Shift value for RTCC_OF                     */
#define _RTCC_IEN_OF_MASK                       0x1UL                                   /**< Bit mask for RTCC_OF                        */
#define _RTCC_IEN_OF_DEFAULT                    0x00000000UL                            /**< Mode DEFAULT for RTCC_IEN                   */
#define RTCC_IEN_OF_DEFAULT                     (_RTCC_IEN_OF_DEFAULT << 0)             /**< Shifted mode DEFAULT for RTCC_IEN           */
#define RTCC_IEN_CNTTICK                        (0x1UL << 1)                            /**< CNTTICK Interrupt Enable                    */
#define _RTCC_IEN_CNTTICK_SHIFT                 1                                       /**< Shift value for RTCC_CNTTICK                */
#define _RTCC_IEN_CNTTICK_MASK                  0x2UL                                   /**< Bit mask for RTCC_CNTTICK                   */
#define _RTCC_IEN_CNTTICK_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for RTCC_IEN                   */
#define RTCC_IEN_CNTTICK_DEFAULT                (_RTCC_IEN_CNTTICK_DEFAULT << 1)        /**< Shifted mode DEFAULT for RTCC_IEN           */
#define RTCC_IEN_CC0                            (0x1UL << 2)                            /**< CC Channel n Interrupt Enable               */
#define _RTCC_IEN_CC0_SHIFT                     2                                       /**< Shift value for RTCC_CC0                    */
#define _RTCC_IEN_CC0_MASK                      0x4UL                                   /**< Bit mask for RTCC_CC0                       */
#define _RTCC_IEN_CC0_DEFAULT                   0x00000000UL                            /**< Mode DEFAULT for RTCC_IEN                   */
#define RTCC_IEN_CC0_DEFAULT                    (_RTCC_IEN_CC0_DEFAULT << 2)            /**< Shifted mode DEFAULT for RTCC_IEN           */
#define RTCC_IEN_CC1                            (0x1UL << 3)                            /**< CC Channel n Interrupt Enable               */
#define _RTCC_IEN_CC1_SHIFT                     3                                       /**< Shift value for RTCC_CC1                    */
#define _RTCC_IEN_CC1_MASK                      0x8UL                                   /**< Bit mask for RTCC_CC1                       */
#define _RTCC_IEN_CC1_DEFAULT                   0x00000000UL                            /**< Mode DEFAULT for RTCC_IEN                   */
#define RTCC_IEN_CC1_DEFAULT                    (_RTCC_IEN_CC1_DEFAULT << 3)            /**< Shifted mode DEFAULT for RTCC_IEN           */
#define RTCC_IEN_CC2                            (0x1UL << 4)                            /**< CC Channel n Interrupt Enable               */
#define _RTCC_IEN_CC2_SHIFT                     4                                       /**< Shift value for RTCC_CC2                    */
#define _RTCC_IEN_CC2_MASK                      0x10UL                                  /**< Bit mask for RTCC_CC2                       */
#define _RTCC_IEN_CC2_DEFAULT                   0x00000000UL                            /**< Mode DEFAULT for RTCC_IEN                   */
#define RTCC_IEN_CC2_DEFAULT                    (_RTCC_IEN_CC2_DEFAULT << 4)            /**< Shifted mode DEFAULT for RTCC_IEN           */

/* Bit fields for RTCC PRECNT */
#define _RTCC_PRECNT_RESETVALUE                 0x00000000UL                            /**< Default value for RTCC_PRECNT               */
#define _RTCC_PRECNT_MASK                       0x00007FFFUL                            /**< Mask for RTCC_PRECNT                        */
#define _RTCC_PRECNT_PRECNT_SHIFT               0                                       /**< Shift value for RTCC_PRECNT                 */
#define _RTCC_PRECNT_PRECNT_MASK                0x7FFFUL                                /**< Bit mask for RTCC_PRECNT                    */
#define _RTCC_PRECNT_PRECNT_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for RTCC_PRECNT                */
#define RTCC_PRECNT_PRECNT_DEFAULT              (_RTCC_PRECNT_PRECNT_DEFAULT << 0)      /**< Shifted mode DEFAULT for RTCC_PRECNT        */

/* Bit fields for RTCC CNT */
#define _RTCC_CNT_RESETVALUE                    0x00000000UL                            /**< Default value for RTCC_CNT                  */
#define _RTCC_CNT_MASK                          0xFFFFFFFFUL                            /**< Mask for RTCC_CNT                           */
#define _RTCC_CNT_CNT_SHIFT                     0                                       /**< Shift value for RTCC_CNT                    */
#define _RTCC_CNT_CNT_MASK                      0xFFFFFFFFUL                            /**< Bit mask for RTCC_CNT                       */
#define _RTCC_CNT_CNT_DEFAULT                   0x00000000UL                            /**< Mode DEFAULT for RTCC_CNT                   */
#define RTCC_CNT_CNT_DEFAULT                    (_RTCC_CNT_CNT_DEFAULT << 0)            /**< Shifted mode DEFAULT for RTCC_CNT           */

/* Bit fields for RTCC COMBCNT */
#define _RTCC_COMBCNT_RESETVALUE                0x00000000UL                            /**< Default value for RTCC_COMBCNT              */
#define _RTCC_COMBCNT_MASK                      0xFFFFFFFFUL                            /**< Mask for RTCC_COMBCNT                       */
#define _RTCC_COMBCNT_PRECNT_SHIFT              0                                       /**< Shift value for RTCC_PRECNT                 */
#define _RTCC_COMBCNT_PRECNT_MASK               0x7FFFUL                                /**< Bit mask for RTCC_PRECNT                    */
#define _RTCC_COMBCNT_PRECNT_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for RTCC_COMBCNT               */
#define RTCC_COMBCNT_PRECNT_DEFAULT             (_RTCC_COMBCNT_PRECNT_DEFAULT << 0)     /**< Shifted mode DEFAULT for RTCC_COMBCNT       */
#define _RTCC_COMBCNT_CNTLSB_SHIFT              15                                      /**< Shift value for RTCC_CNTLSB                 */
#define _RTCC_COMBCNT_CNTLSB_MASK               0xFFFF8000UL                            /**< Bit mask for RTCC_CNTLSB                    */
#define _RTCC_COMBCNT_CNTLSB_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for RTCC_COMBCNT               */
#define RTCC_COMBCNT_CNTLSB_DEFAULT             (_RTCC_COMBCNT_CNTLSB_DEFAULT << 15)    /**< Shifted mode DEFAULT for RTCC_COMBCNT       */

/* Bit fields for RTCC SYNCBUSY */
#define _RTCC_SYNCBUSY_RESETVALUE               0x00000000UL                            /**< Default value for RTCC_SYNCBUSY             */
#define _RTCC_SYNCBUSY_MASK                     0x0000000FUL                            /**< Mask for RTCC_SYNCBUSY                      */
#define RTCC_SYNCBUSY_START                     (0x1UL << 0)                            /**< Sync busy for START                         */
#define _RTCC_SYNCBUSY_START_SHIFT              0                                       /**< Shift value for RTCC_START                  */
#define _RTCC_SYNCBUSY_START_MASK               0x1UL                                   /**< Bit mask for RTCC_START                     */
#define _RTCC_SYNCBUSY_START_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for RTCC_SYNCBUSY              */
#define RTCC_SYNCBUSY_START_DEFAULT             (_RTCC_SYNCBUSY_START_DEFAULT << 0)     /**< Shifted mode DEFAULT for RTCC_SYNCBUSY      */
#define RTCC_SYNCBUSY_STOP                      (0x1UL << 1)                            /**< Sync busy for STOP                          */
#define _RTCC_SYNCBUSY_STOP_SHIFT               1                                       /**< Shift value for RTCC_STOP                   */
#define _RTCC_SYNCBUSY_STOP_MASK                0x2UL                                   /**< Bit mask for RTCC_STOP                      */
#define _RTCC_SYNCBUSY_STOP_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for RTCC_SYNCBUSY              */
#define RTCC_SYNCBUSY_STOP_DEFAULT              (_RTCC_SYNCBUSY_STOP_DEFAULT << 1)      /**< Shifted mode DEFAULT for RTCC_SYNCBUSY      */
#define RTCC_SYNCBUSY_PRECNT                    (0x1UL << 2)                            /**< Sync busy for PRECNT                        */
#define _RTCC_SYNCBUSY_PRECNT_SHIFT             2                                       /**< Shift value for RTCC_PRECNT                 */
#define _RTCC_SYNCBUSY_PRECNT_MASK              0x4UL                                   /**< Bit mask for RTCC_PRECNT                    */
#define _RTCC_SYNCBUSY_PRECNT_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for RTCC_SYNCBUSY              */
#define RTCC_SYNCBUSY_PRECNT_DEFAULT            (_RTCC_SYNCBUSY_PRECNT_DEFAULT << 2)    /**< Shifted mode DEFAULT for RTCC_SYNCBUSY      */
#define RTCC_SYNCBUSY_CNT                       (0x1UL << 3)                            /**< Sync busy for CNT                           */
#define _RTCC_SYNCBUSY_CNT_SHIFT                3                                       /**< Shift value for RTCC_CNT                    */
#define _RTCC_SYNCBUSY_CNT_MASK                 0x8UL                                   /**< Bit mask for RTCC_CNT                       */
#define _RTCC_SYNCBUSY_CNT_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for RTCC_SYNCBUSY              */
#define RTCC_SYNCBUSY_CNT_DEFAULT               (_RTCC_SYNCBUSY_CNT_DEFAULT << 3)       /**< Shifted mode DEFAULT for RTCC_SYNCBUSY      */

/* Bit fields for RTCC LOCK */
#define _RTCC_LOCK_RESETVALUE                   0x00000000UL                            /**< Default value for RTCC_LOCK                 */
#define _RTCC_LOCK_MASK                         0x0000FFFFUL                            /**< Mask for RTCC_LOCK                          */
#define _RTCC_LOCK_LOCKKEY_SHIFT                0                                       /**< Shift value for RTCC_LOCKKEY                */
#define _RTCC_LOCK_LOCKKEY_MASK                 0xFFFFUL                                /**< Bit mask for RTCC_LOCKKEY                   */
#define _RTCC_LOCK_LOCKKEY_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for RTCC_LOCK                  */
#define _RTCC_LOCK_LOCKKEY_UNLOCK               0x0000AEE8UL                            /**< Mode UNLOCK for RTCC_LOCK                   */
#define RTCC_LOCK_LOCKKEY_DEFAULT               (_RTCC_LOCK_LOCKKEY_DEFAULT << 0)       /**< Shifted mode DEFAULT for RTCC_LOCK          */
#define RTCC_LOCK_LOCKKEY_UNLOCK                (_RTCC_LOCK_LOCKKEY_UNLOCK << 0)        /**< Shifted mode UNLOCK for RTCC_LOCK           */

